-----------------------------------<Query1>--------------------------------------<|
--<1. Вивести таблицю кафедр, але розташувати її поля у зворотному порядку------<|
SELECT * FROM Departmens ORDER BY Name DESC;
-----------------------------------<Query2>--------------------------------------<|
--<2. Вивести назви груп та їх рейтинги, використовуючи, як назви полів, що
-- виводяться, “Group Name” та “Group Rating” відповідно-------------------------<|
SELECT Name AS 'Group Name', Rating AS 'Group Rating' FROM Groups;
-----------------------------------<Query3>--------------------------------------<|
--Вивести для викладачів їхнє прізвище, відсоток ставки по відношенню до 
--надбавки та відсоток ставки по відношенню до зарплати (сума ставки та надбавки)<|
SELECT Surname, (Salary/Premium)*100 AS [Percent Salary],Salary/(Salary+Premium) AS [Prosent Income]
FROM Teachers;
-----------------------------------<Query4>--------------------------------------<|
--Вивести таблицю факультетів у вигляді одного поля у такому форматі: “The
-- dean of faculty [faculty] is [dean]-------------------------------------------<|
SELECT 'The dean of faculty'+ Name + 'is'+ ' ' +Dean
AS [Faculties Info]
FROM Faculties;
-----------------------------------<Query5>---------------------------------------<|
--5. Вивести прізвища викладачів, які є професорами та ставка яких перевищує 1050-<|
SELECT Surname FROM Teachers
WHERE IsProfessor= 1 AND Salary>1050;
-----------------------------------<Query6>---------------------------------------<|
--Вивести назви кафедр, фонд фінансування яких менший за 11000 або більше 25000---<|
SELECT Name FROM Departmens
WHERE Financing <11000 OR Financing >25000;
-----------------------------------<Query7>---------------------------------------<|
--Вивести назви факультетів, окрім факультету “Computer Science”------------------<|
SELECT * FROM Faculties
Where Name != 'Computer Science';
-----------------------------------<Query8>---------------------------------------<|
--Вивести прізвища та посади викладачів, які не є професорами--------------------<|
SELECT Surname ,Position FROM Teachers
WHERE IsProfessor =0;
-----------------------------------<Query9>---------------------------------------<|
--Вивести прізвища, посади, ставки та надбавки асистентів, у яких надбавка у 
--діапазоні від 160 до 550--------------------------------------------------------<|
SELECT Surname, Position,Salary,Premium FROM Teachers
WHERE IsAssistant =1 AND Premium BETWEEN 160 AND 550;
-----------------------------------<Query10>--------------------------------------<|
-- Вивести прізвища та ставки асистентів------------------------------------------<|
SELECT Surname, Salary FROM Teachers
WHERE IsAssistant =1;
-----------------------------------<Query11>---------------------------------------<|
--Вивести назви кафедр, які в алфавітному порядку розміщуються до кафедри---------
--“Software Development”. Поле, що виводиться повинно мати назву “Name of Departme<|
SELECT Name AS [Name of Departmet] FROM Departmens 
WHERE Name< 'Software Development'
ORDER BY Name ASC;
-----------------------------------<Query12>--------------------------------------<|
--Вивести прізвища асистентів, які мають зарплату (сума ставки та надбавки) не 
---більше 1200.-------------------------------------------------------------------<|
SELECT Surname FROM Teachers
WHERE IsAssistant =1 AND (Salary+Premium) <=1200;
-----------------------------------<Query13>--------------------------------------<|
--Вивести назви груп 5-го курсу, які мають рейтинг у діапазоні від 2 до 4--------<|
SELECT Name FROM Groups
WHERE YEAR=5 AND Rating BETWEEN 2 AND 4;
-----------------------------------<Query14>--------------------------------------<|
--Вивести прізвища асистентів зі ставкою менше 550 або надбавкою менше 200--------<|
SELECT Surname FROM Teachers
WHERE IsAssistant =1 AND Salary <550 OR Premium<200;
-----------------------------------<Query15>--------------------------------------<|
--Вивести прізвища та посади викладачів, які не є професорами--------------------<|
SELECT Surname, Position FROM Teachers
WHERE IsProfessor=0;