--------------------------------------TASK1--------------------------------------------<|
--Забороніть користувачеві з логіном Марк отримувати інформацію про продавців---------<|
REVOKE GRANT SELECT 
ON Shop.Sallers
FROM Mark;
--Дозвольте користувачеві з логіном Девід отримувати інформацію тільки про продавця---<|
GRANT SELECT 
ON Shop.Sallers
TO Devid
--Надайте повний доступ до бази даних користувачеві з логіном Ольга-------------------<|
 GRANT CONTROL
 ON DATABASE ::Shop
 TO Olga;
 --Надайте доступ тільки на читання таблиць з інформацією про продавців, товарах в----<|
 --наявності користувачеві з логіном Констянтин.---------------------------------------
GRANT SELECT 
ON Shop (Sallers,GoodsInShop)
TO  Konstantin;
------------------------------------TASK2-----------------------------------------------<|
--Надайте користувачеві з логіном Олег доступ на читання всіх таблиць-------------------<|
GRANT SELECT ON DATABASE ::MusicCollection
TO Oleh
--Забороніть користувачеві з логіном Олег змінювати дані у всіх таблицях;---------------<|
DENY ALTER ON DATABASE ::MusicCollection
TO Oleh
--Забороніть усім користувачам, окрім користувача з логіном Дмитро, читати дані з таблиці альбомі
DENY SELECT ON  OBJECT::MusicCollection.Albums to PUBLIC
GRANT SELECT ON MusicCollection.Album TO Dmytro
--Надайте можливість читання даних із таблиці стилів користувачам з логінами: ----------
--Борис, Діана, Микола, Ірини----------------------------------------------------------<|
GRANT SELECT 
 ON  OBJECT::MusicCollection.Styles
 TO Borys,Diana,Mykola,Iryna;
